viys/Configuration/Keil5 MDK/stm32/Keil.STM32F0xx_DFP.1.0.3.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32F0xx_DFP</name>
  <description>STMicroelectronics STM32F0 Series Device Support and Examples</description>

  <releases>
    <release version="1.0.3">
      Added: STM32F042 subfamily
    </release>
    <release version="1.0.2">
      Deleted: Book Entry "STM32F0 Discovery Board" from device section
    </release>
    <release version="1.0.1">
      Updated: device names changed in accordance to STMicroelectronics
    </release>
    <release version="1.0.0">
      First Release version of STM32F0 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F0</keyword>
    <keyword>STM32</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="STM32F0 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book    name="Documents\dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
        <description>
STMicroelectronics' STM32F0 series delivers 32-bit performance while providing the essentials of the STM32 family, particularly for cost-sensitive applications. STM32 F0 MCUs combine real-time performance, low-power operation, and the advanced architecture and peripherals associated with the STM32 platform available. This series of products is highly competitive in traditional 8-bit and 16-bit markets and eliminates the need to manage different architectures and the associated development overhead.
Typical applications include application control and user interfaces, handheld equipment, A/V receivers and digital TV, PC peripherals, gaming and GPS platforms, industrial applications, PLCs, inverters, printers, scanners, alarm systems, video intercoms, and HVACs

  - SRAM with HW parity checking
  - Timer with deadtime generation and emergency stop
        </description>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="Temp"          n="-40"     m="85"/>


      <!-- ************************  Subfamily 'STM32F030'  **************************** -->
      <subFamily DsubFamily="STM32F030">
        <feature type="ADC"           n="1"       m="12"/>
        <feature type="VCC"           n="2.40"    m="3.60"/>
      
      <!-- *************************  Device 'STM32F030F4'  ***************************** -->
      <device Dname="STM32F030F4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F030"/>
        <debug      svd="SVD\STM32F030.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F030 Series Reference Manual"/>
        <book    name="Documents\STM32F030x468.PDF"                       title="STM32F030 Data Sheet"/>
        <feature type="Timer"         n="4"       m="16"/>
        <feature type="IOs"           n="15"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="SOP"           n="20"/>
      </device>
      
      <!-- *************************  Device 'STM32F030C6'  ***************************** -->
      <device Dname="STM32F030C6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F030"/>
        <debug      svd="SVD\STM32F030.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F030 Series Reference Manual"/>
        <book    name="Documents\STM32F030x468.PDF"                       title="STM32F030 Data Sheet"/>
        <feature type="Timer"         n="4"       m="16"/>
        <feature type="IOs"           n="39"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32F030K6'  ***************************** -->
      <device Dname="STM32F030K6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F030"/>
        <debug      svd="SVD\STM32F030.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F030 Series Reference Manual"/>
        <book    name="Documents\STM32F030x468.PDF"                       title="STM32F030 Data Sheet"/>
        <feature type="Timer"         n="4"       m="16"/>
        <feature type="IOs"           n="26"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="QFP"           n="32"/>
      </device>
      
      <!-- *************************  Device 'STM32F030C8'  ***************************** -->
      <device Dname="STM32F030C8">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F030"/>
        <debug      svd="SVD\STM32F030.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F030 Series Reference Manual"/>
        <book    name="Documents\STM32F030x468.PDF"                       title="STM32F030 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="IOs"           n="39"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32F030R8'  ***************************** -->
      <device Dname="STM32F030R8">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F030"/>
        <debug      svd="SVD\STM32F030.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F030 Series Reference Manual"/>
        <book    name="Documents\STM32F030x468.PDF"                       title="STM32F030 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="IOs"           n="55"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="64"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F042'  **************************** -->
      <subFamily DsubFamily="STM32F042">
        <feature type="DMA"           n="5"/>
        <feature type="Timer"         n="5"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="I2S"           n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="1"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>
      
      <!-- *************************  Device 'STM32F042C4'  ***************************** -->
      <device Dname="STM32F042C4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="38"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32F042C6'  ***************************** -->
      <device Dname="STM32F042C6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="38"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
