viys/Configuration/Keil5 MDK/stm32/Keil.STM32F0xx_DFP.1.0.3.pdsc
      <!-- *************************  Device 'STM32F042F4'  ***************************** -->
      <device Dname="STM32F042F4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="16"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="SOP"           n="20"/>
      </device>
      
      <!-- *************************  Device 'STM32F042F6'  ***************************** -->
      <device Dname="STM32F042F6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="16"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="SOP"           n="20"/>
      </device>
      
      <!-- *************************  Device 'STM32F042G4'  ***************************** -->
      <device Dname="STM32F042G4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="24"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="QFP"           n="28"/>
      </device>
      
      <!-- *************************  Device 'STM32F042G6'  ***************************** -->
      <device Dname="STM32F042G6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="24"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="QFP"           n="28"/>
      </device>
      
      <!-- *************************  Device 'STM32F042K4'  ***************************** -->
      <device Dname="STM32F042K4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="28"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="QFP"           n="32"/>
      </device>
      
      <!-- *************************  Device 'STM32F042K6'  ***************************** -->
      <device Dname="STM32F042K6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F042"/>
        <debug      svd="SVD\STM32F042x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F042xx.PDF"                         title="STM32F042 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="28"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="QFP"           n="32"/>
      </device>
      
