viys/Configuration/Keil5 MDK/stm32/Keil.STM32F0xx_DFP.1.0.3.pdsc
      <!-- *************************  Device 'STM32F031K6'  ***************************** -->
      <device Dname="STM32F031K6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F031"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F031 Series Reference Manual"/>
        <book    name="Documents\STM32F031xx.PDF"                         title="STM32F031 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="27"/>
        <feature type="QFP"           n="32"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F051'  **************************** -->
      <subFamily DsubFamily="STM32F051">
        <feature type="Timer"         n="7"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="I2S"           n="1"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>
      
      <!-- *************************  Device 'STM32F051C4'  ***************************** -->
      <device Dname="STM32F051C4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="39"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32F051K4'  ***************************** -->
      <device Dname="STM32F051K4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="27"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="QFP"           n="32"/>
      </device>
      
      <!-- *************************  Device 'STM32F051R4'  ***************************** -->
      <device Dname="STM32F051R4">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="19"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="1"       m="6000000"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F051C6'  ***************************** -->
      <device Dname="STM32F051C6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="39"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
