viys/Configuration/Keil5 MDK/stm32/Keil.STM32F0xx_DFP.1.0.3.pdsc
      <!-- *************************  Device 'STM32F051K6'  ***************************** -->
      <device Dname="STM32F051K6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="27"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="32"/>
      </device>
      
      <!-- *************************  Device 'STM32F051R6'  ***************************** -->
      <device Dname="STM32F051R6">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_32.FLM"   start="0x08000000"  size="0x8000"                   default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="19"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F051C8'  ***************************** -->
      <device Dname="STM32F051C8">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="39"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32F051K8'  ***************************** -->
      <device Dname="STM32F051K8">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="IOs"           n="27"/>
        <feature type="SPI"           n="1"       m="18000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="32"/>
      </device>
      
      <!-- *************************  Device 'STM32F051R8'  ***************************** -->
      <device Dname="STM32F051R8">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\stm32f0xx.h"  define="STM32F051"/>
        <debug      svd="SVD\STM32F0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash\STM32F0xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F05_F06_RM.PDF"                     title="STM32F051 Series Reference Manual"/>
        <book    name="Documents\STM32F051xx.PDF"                         title="STM32F051 Data Sheet"/>
        <feature type="ADC"           n="19"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="2"       m="6000000"/>
        <feature type="QFP"           n="64"/>
      </device>
      </subFamily>

