viys/Configuration/Keil5 MDK/stm32/Keil.STM32F0xx_DFP.1.0.3.pdsc
    <condition id="STM32F030">
      <description>STMicroelectronics STM32F030 Series devices</description>
      <require Dname="STM32F030*"/>
    </condition>
    <condition id="STM32F031">
      <description>STMicroelectronics STM32F031 Series devices</description>
      <require Dname="STM32F031*"/>
    </condition>
    <condition id="STM32F042">
      <description>STMicroelectronics STM32F042 Series devices</description>
      <require Dname="STM32F042*"/>
    </condition>
    <condition id="STM32F051">
      <description>STMicroelectronics STM32F051 Series devices</description>
      <require Dname="STM32F051*"/>
    </condition>
    <condition id="STM32F071">
      <description>STMicroelectronics STM32F071 Series devices</description>
      <require Dname="STM32F071*"/>
    </condition>
    <condition id="STM32F072">
      <description>STMicroelectronics STM32F072 Series devices</description>
      <require Dname="STM32F072*"/>
    </condition>
    <condition id="STM32F078">
      <description>STMicroelectronics STM32F078 Series devices</description>
      <require Dname="STM32F078*"/>
    </condition>

    <!-- merged conditions, because one file cannot have more than one condition! -->
    <condition id="STM32F051_71">
      <description>STMicroelectronics STM32F051_71 Series devices</description>
      <accept condition="STM32F051"/>
      <accept condition="STM32F071"/>
    </condition>
    <condition id="STM32F072_78">
      <description>STMicroelectronics STM32F072_78 Series devices</description>
      <accept condition="STM32F072"/>
      <accept condition="STM32F078"/>
    </condition>

    <condition id="STM32F0xx CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>STMicroelectronics STM32F0 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F0*"/>
    </condition>

  </conditions>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F0-Discovery\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F0-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32F0xx CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32F0 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32F0xx    /* Device Startup for STM32F0 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_stm32f030.s"   attr="config"    condition="STM32F030"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f031.s"   attr="config"    condition="STM32F031"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f042.s"   attr="config"    condition="STM32F042"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f051.s"   attr="config"    condition="STM32F051_71"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f072.s"   attr="config"    condition="STM32F072_78"/>

        <!-- system file -->
        <file category="source" name="Device\Source\system_stm32f0xx.c"         attr="config"    condition="STM32F0xx CMSIS Device"/>
        
      </files>
    </component>
    
  </components>
</package>
